<?php

return [

    //---------------------------------------------------------------------------//
    // 1] История обновлений базы данных пакета. Не редактировать вручную.       //
    //    History of updates of database of the package. Don't edit it manually. //
    //---------------------------------------------------------------------------//
    'updateshistory'    => [],

    //-------------------------------------------------------------------------//
    // 2] История обновлений конфига пакета. Не редактировать вручную.         //
    //    History of updates of config of the package. Don't edit it manually. //
    //-------------------------------------------------------------------------//
    'cnfupdshistory'    => [],

    //------------------------------//
    // 3] Имя и описание пакета     //
    //    Locale of package         //
    //------------------------------//
    'aboutpack' => [
      'RU' => [
        'name'        => "Log",
        'description' => "App Log",
      ],
      'EN' => [
        'name'        => "Log",
        'description' => "App Log",
      ]
    ],

    //-----------------------------------//
    // 4] IP-адрес websocket-сервера     //
    //    IP-address of websocket-server //
    //-----------------------------------//
    'websocket_server_ip' => 'http://localhost:6001',

    //-----------------------------------------------//
    // 5] Лимитирования объёма хранимых логом данных //
    //    Limit of stored log data                   //
    //-----------------------------------------------//

      // 5.1] Тип лимитирования / Limit type //
      //-------------------------------------//
      // 1 - по времени + по кол-ву записей   / by time + by number of records
      // 2 - только по времени                / only by time
      // 3 - только по кол-ву записей         / only by number of records
      'limit_type' => '2',

      // 5.2] Ограничение по времени хранения в днях / The time limit of storage in days //
      //---------------------------------------------------------------------------------//
      'limit_max_storetime_days' => '30',

      // 5.3] Ограничение по кол-ву записей в логе / Limit count of records in the log //
      //-------------------------------------------------------------------------------//
      'limit_max_count' => '100000',

];
