<?php

return [

    //---------------------------------------------------------------------------//
    // 1] История обновлений базы данных пакета. Не редактировать вручную.       //
    //    History of updates of database of the package. Don't edit it manually. //
    //---------------------------------------------------------------------------//
    'updateshistory'    => [],

    //-------------------------------------------------------------------------//
    // 2] История обновлений конфига пакета. Не редактировать вручную.         //
    //    History of updates of config of the package. Don't edit it manually. //
    //-------------------------------------------------------------------------//
    'cnfupdshistory'    => [],

    //-----------------//
    // 3] Локализация  //
    //    localization //
    //-----------------//

      // 3.1] Поддерживаемые пакетом локали | The locales that are supported by the package //
      //------------------------------------------------------------------------------------//
      'locales' => ['RU', 'EN'],

      // 3.2] Выбранная локаль | Chosen locale //
      //---------------------------------------//
      // - If the value is empty, uses config('app.locale')
      // - Else if config('app.locale') not in 'locales', uses 1-st of 'locales'
      // - Else if 1-st of 'locales' is empty, uses 'RU'.
      'locale' => '',

    //----------------------------------------//
    // 4] Имя и описание пакета               //
    //    Name and description of the package //
    //----------------------------------------//
    'aboutpack' => [
      'RU' => [
        'name'        => "Log",
        'description' => "App Log",
      ],
      'EN' => [
        'name'        => "Log",
        'description' => "App Log",
      ]
    ],

    //-----------------------------------//
    // 5] IP-адрес websocket-сервера     //
    //    IP-address of websocket-server //
    //-----------------------------------//
    'websocket_server_ip' => 'http://localhost:6001',

    //-----------------------------------------------//
    // 6] Лимитирования объёма хранимых логом данных //
    //    Limit of stored log data                   //
    //-----------------------------------------------//

      // 6.1] Тип лимитирования / Limit type //
      //-------------------------------------//
      // 1 - по времени + по кол-ву записей   / by time + by number of records
      // 2 - только по времени                / only by time
      // 3 - только по кол-ву записей         / only by number of records
      'limit_type' => '2',

      // 6.2] Ограничение по времени хранения в днях / The time limit of storage in days //
      //---------------------------------------------------------------------------------//
      'limit_max_storetime_days' => '30',

      // 6.3] Ограничение по кол-ву записей в логе / Limit count of records in the log //
      //-------------------------------------------------------------------------------//
      'limit_max_count' => '100000',

];
